{
  "ntt_data_telefonica.title": "Software Engineer",
  "ntt_data_telefonica.activities.0": "Served as lead front-end engineer, bridging business and technical teams by translating client requirements into actionable technical specifications, while driving sprint planning, risk assessment, effort estimation, and feature implementation.",
  "ntt_data_telefonica.activities.1": "Architected and executed modernization of legacy sales application using Angular, reducing development cycle time and enhancing team velocity through strategic component-based design.",
  "ntt_data_telefonica.activities.2": "Deployed Azure cloud infrastructure incorporating version control, automated CI/CD pipelines, and Kubernetes orchestration (AKS) to optimize containerized application delivery, improving deployment frequency from weekly to daily.",

  "ntt_data_banco_popular.title": "Software Engineer",
  "ntt_data_banco_popular.activities.0": "Directed strategic planning and risk mitigation across multiple quarters, safeguarding project timelines and bolstering stakeholder confidence by proactively addressing operational risks.",
  "ntt_data_banco_popular.activities.1": "Architected and led a hybrid cloud integration solution to automate client processes, orchestrating on-premises services with AWS. Enforced robust security via DataPower Gateway using signed and mutual authentication certificates.",
  "ntt_data_banco_popular.activities.2": "Authored comprehensive service contracts (WSDL, YAML and SWAGGER) to streamline cross-team collaboration, ensuring seamless system integration and securing Architecture Committee approval.",
  "ntt_data_banco_popular.activities.3": "Owned the end-to-end service development lifecycle: designed system architecture, managed deployments on WebLogic, and validated performance through rigorous testing (unit, load, stress using JMeter), with detailed documentation of design and deployment processes.",
  "ntt_data_banco_popular.activities.4": "Maintained and supported legacy microservices and ETL pipelines in production environments, resolving critical issues while progressively modernizing authentication and security protocols using Java 8.",

  "ntt_data_ibm.title": "Software Engineer",
  "ntt_data_ibm.activities.0": "Leveraged enterprise integration technologies by receiving training in IBM Toolkit and MuleSoft, and implementing API Gateway solutions with comprehensive service contract development in WSDL, YAML and SWAGGER formats.",

  "ntt_data_bbva.title": "Software Engineer",
  "ntt_data_bbva.activities.0": "Expanded front-end development skills through comprehensive training in modern web component technologies, including Web Components, Styled Components, and Lit Element, with a solid foundation in core web technologies HTML and CSS.",

  "4coders.title": "Junior Software Engineer",
  "4coders.activities.0": "Developed reusable, modular front-end components using React and VueJS with TypeScript, implementing custom npm library-based components while collaborating closely with UX/UI design teams to translate Figma templates into functional Micro-Frontend architectures.",
  "4coders.activities.1": "Developed internationalized (i18n) and accessible (a11y) user interfaces, ensuring seamless user experience across multiple languages, regions, and devices.",
  "4coders.activities.2": "Back-end practitioner using NodeJS for microservices and REST responses with SQL queries."
}