{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "55"}, {"size": "40"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}, {"size": "4"}, {"size": "1"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "16"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "16"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_1/depthwise/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_1/convolution/merged_input", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "32"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_bn_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/global_max_pooling2d_1/Max/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "55"}, {"size": "40"}, {"size": "1"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["input_layer", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_1/convolution/merged_input", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "5", "2", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_1/depthwise", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_1/convolution/merged_input", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_1/depthwise", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_relu_1/Relu6", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_1/convolution/merged_input", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_1/depthwise/ReadVariableOp"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_1/depthwise", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/mul_1", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_bn_1/batchnorm/add_1", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_1/convolution/merged_input", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_bn_1/batchnorm/sub"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "U0FNRQ=="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/global_max_pooling2d_1/Max", "op": "Max", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_bn_1/batchnorm/add_1", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/global_max_pooling2d_1/Max/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_relu_1/Relu6", "op": "Relu6", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/global_max_pooling2d_1/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_relu_1/Relu6", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/BiasAdd", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/mul_1", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/activation_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/activation_1/Relu", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2129}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_1/convolution/merged_input", "shape": [10, 4, 1, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv1_bn_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_1/depthwise/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_1_bn_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_1/convolution/merged_input", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_1_bn_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_1/depthwise/ReadVariableOp", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/mul", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_2_bn_1/batchnorm/sub", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_1/convolution/merged_input", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_2_bn_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_1/depthwise/ReadVariableOp", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/mul", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_dw_3_bn_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_1/convolution/merged_input", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/conv_pw_3_bn_1/batchnorm/sub", "shape": [32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/global_max_pooling2d_1/Max/reduction_indices", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/Cast/ReadVariableOp", "shape": [32, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/mul", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/batch_normalization_1/batchnorm/sub", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/Cast/ReadVariableOp", "shape": [64, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/mobilenet_slimmed_v2_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}